## Q1: What are missing values in a dataset? Why is it essential to handle missing values? Name some algorithms that are not affected by missing values.

##  Missing data is defined as the values or data that is not stored (or not present) for some variable/s in the given dataset. Below is a sample of the missing data from the Titanic dataset. You can see the columns 'Age' and 'Cabin' have some missing values.

## Missing values can pose a significant challenge in data analysis, as they can: Reduce the sample size: This can decrease the accuracy and reliability of your analysis. Introduce bias: If the missing data is not handled properly, it can bias the results of your analysis.

## All the machine learning algorithms don't support missing values but some ML algorithms are robust to missing values in the dataset. The k-NN algorithm can ignore a column from a distance measure when a value is missing. Naive Bayes can also support missing values when making a prediction.

## Q2: List down techniques used to handle missing data. Give an example of each with python code.

##  List of Methods to handle missing values in a dataset
## Deleting the Missing Values.
## Imputing the Missing Values.
## Imputing the Missing Values for Categorical Features.

In [1]:
import pandas as pd
import seaborn as sns

df=sns.load_dataset('titanic')


df.shape

(891, 15)

In [2]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
df2 = df.dropna()
df2.shape

(182, 15)

In [4]:
df2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [8]:

df['fare'] = df['fare'].fillna(df['fare'].mean()) 

# replacing missing values in price column 
# with median of that column 
df['age'] = df['age'].fillna(df['age'].median()) 

# replacing missing values in bought column with 
# standard deviation of that column 
df['survived	'] = df['survived'].fillna(df['survived'].std()) 



print(df)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female  28.0      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone  survived\t
0      man        True  NaN  Southampton    no  False           0
1    woman       False    C    Cherbourg   yes  False           1
2    woman       False  NaN  Southampton   yes   True           1
3    woman       False    C  Southampton   yes  False           1
4      man        True  NaN  Southampton    no   True           0
..     ...         ...  ...          ...   ...    ...         ...
886    man        True  NaN  Southampton    no   True           0
887  woman       False    B  Southampton   yes   True           1
888  woman       False  NaN  Southampton    no  False           0
889    man        True    C    Cherbourg   yes   True           1
890    man        True  NaN   Queenstown    no   True           0

[891 rows x 16 columns]

In [3]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

#Creating dataset
data = pd.DataFrame({'SocialApps':['facebook', 'whatsapp', 
      'instagram', 'facebook', np.nan]})

print(data)

  SocialApps
0   facebook
1   whatsapp
2  instagram
3   facebook
4        NaN

In [4]:
# Creating a SimpleImputer object
imp = SimpleImputer(strategy='most_frequent')

"""" Impute the missing values in the 'SocialApps' 
    column of the 'data' DataFrame"""

# Fitting transform
data['SocialApps'] = imp.fit_transform(data[['SocialApps']])

#Printing result
print(data['SocialApps'])

0     facebook
1     whatsapp
2    instagram
3     facebook
4     facebook
Name: SocialApps, dtype: object

## Q3: Explain the imbalanced data. What will happen if imbalanced data is not handled?

## Imbalanced data sets are a special case for classification problem where the class distribution is not uniform among the classes. Typically, they are composed by two classes: The majority (negative) class and the minority (positive) class [1].

## Potential Poor Performance on Majority Class.
## Undersampling may lead to a model that performs poorly on the majority class since it has less information to learn from. This can result in misclassification of the majority class instances.

## Q4: What are Up-sampling and Down-sampling? Explain with an example when up-sampling and down-sampling are required.

## Two types of resampling are Up-sampling and Down-sampling: After this process, the counts of both labels are almost the same.
## Upsampling: Upsampling is a procedure where synthetically generated data points (corresponding to minority class) are injected into the dataset. Where you increase the frequency of the samples, such as from minutes to seconds.
## Downsampling:This is done by systematically selecting a subset of the data at a lower rate than the original. The main goal of downsampling is to reduce the computational requirements, storage needs, and potentially noise in your data. Where you decrease the frequency of the samples, such as from days to months.

## Q5: What is data Augmentation? Explain SMOTE.

## Data augmentation is the process of artificially generating new data from existing data, primarily to train new machine learning (ML) models.

## SMOTE: Synthetic Minority Oversampling Technique
## SMOTE is an oversampling technique where the synthetic samples are generated for the minority class. This algorithm helps to overcome the overfitting problem posed by random oversampling.

## Q6: What are outliers in a dataset? Why is it essential to handle outliers?

## An outlier is a data point that is significantly different from the other data points in a dataset. Its value is mostly unexpected and deviates a lot from the mean of the dataset. The task of outlier detection is to detect these points.

## It is essential to detect and handle outliers appropriately to ensure the accuracy and validity of machine learning models. Outliers can provide valuable insights into the data, but they can also lead to biased or incorrect results if not handled appropriately.

## Q7: You are working on a project that requires analyzing customer data. However, you notice that some of the data is missing. What are some techniques you can use to handle the missing data in your analysis?


## Mean imputation: Replace missing values with the mean of the variable.
## Median imputation: Replace missing values with the median of the variable.
## Mode imputation: Replace missing values with the most frequent value of the variable.

## Q8: You are working with a large dataset and find that a small percentage of the data is missing. What are some strategies you can use to determine if the missing data is missing at random or if there is a pattern to the missing data?

## Methods for identifying missing data
## There are multiple methods that can be used to identify missing data in pandas. Below are the most recurrent ones.

## .isnull() :This function returns a pandas dataframe, where each value is a boolean value True if the value is missing, False otherwise.

## .notnull() :Similarly to the previous function, the values for this one are False if either NaN or None value is detected.

## .info() :This function generates three main columns, including the “Non-Null Count” which shows the number of non-missing values for each column.

## .isna() :This one is similar to isnull and notnull. However it shows True only when the missing value is NaN type.

## Choosing the right imputation method based on the type of missing data

In [7]:
import pandas as pd

df=pd.DataFrame({"Type of missing data": ["Missing Completely At Random","Missing At Random","Missing Not At Random"],
                 "Imputation method":["Mean, Median, Mode, or any other imputation method",
                    "Multiple imputation ,Regression imputation","Pattern Substitution, Maximum Likelihood estimation"]})

In [8]:
df

,Type of missing data,Imputation method
0,Missing Completely At Random,"Mean, Median, Mode, or any other imputation me..."
1,Missing At Random,"Multiple imputation ,Regression imputation"
2,Missing Not At Random,"Pattern Substitution, Maximum Likelihood estim..."

## Q9: Suppose you are working on a medical diagnosis project and find that the majority of patients in the dataset do not have the condition of interest, while a small percentage do. What are some strategies you can use to evaluate the performance of your machine learning model on this imbalanced dataset?

##  To manage class imbalance in a dataset, techniques such as SMOTE, Random Undersampling, and Cross-Validation, along with stratified random sampling, can be used to balance the dataset and minimize selection biases.

## A widely adopted and perhaps the most straightforward method for dealing with highly imbalanced datasets is called resampling. It consists of removing samples from the majority class (under-sampling) and/or adding more examples from the minority class (over-sampling).

## In this project, majority of patients in the dataset do not have the condition of interest, while a small percentage do. Here we go with the resampling method.

## Q10: When attempting to estimate customer satisfaction for a project, you discover that the dataset is unbalanced, with the bulk of customers reporting being satisfied. What methods can you employ to balance the dataset and down-sample the majority class?

## Methods you can employ to balance the dataset and down sample the majority class
## Resampling (Oversampling and Undersampling)

## This technique is used to upsample or downsample the minority or majority class. When we are using an imbalanced dataset, we can oversample the minority class using replacement. This technique is called oversampling.

## In this project, The dataset is unbalanced, with the bulk of customers reporting being satisfied. We can oversample the customers data who are not satisfied.

## Q11: You discover that the dataset is unbalanced with a low percentage of occurrences while working on a project that requires you to estimate the occurrence of a rare event. What methods can you employ to balance the dataset and up-sample the minority class?

##  The dataset is unbalanced with a low percentage of occurrences while working on a project that requires to estimate the occurrence of a rare event.

## We can deal with the oversmpling method to balance the dataset and up-sample the minority class.